module {
  func.func @main(%arg0: !torch.vtensor<[64],f32>, %arg1: !torch.vtensor<[64],f32>, %arg2: !torch.vtensor<[],si64>, %arg3: !torch.vtensor<[256],f32>, %arg4: !torch.vtensor<[256],f32>, %arg5: !torch.vtensor<[],si64>, %arg6: !torch.vtensor<[64],f32>, %arg7: !torch.vtensor<[64],f32>, %arg8: !torch.vtensor<[],si64>, %arg9: !torch.vtensor<[64],f32>, %arg10: !torch.vtensor<[64],f32>, %arg11: !torch.vtensor<[],si64>, %arg12: !torch.vtensor<[256],f32>, %arg13: !torch.vtensor<[256],f32>, %arg14: !torch.vtensor<[],si64>, %arg15: !torch.vtensor<[64],f32>, %arg16: !torch.vtensor<[64],f32>, %arg17: !torch.vtensor<[],si64>, %arg18: !torch.vtensor<[64],f32>, %arg19: !torch.vtensor<[64],f32>, %arg20: !torch.vtensor<[],si64>, %arg21: !torch.vtensor<[256],f32>, %arg22: !torch.vtensor<[256],f32>, %arg23: !torch.vtensor<[],si64>, %arg24: !torch.vtensor<[64],f32>, %arg25: !torch.vtensor<[64],f32>, %arg26: !torch.vtensor<[],si64>, %arg27: !torch.vtensor<[64],f32>, %arg28: !torch.vtensor<[64],f32>, %arg29: !torch.vtensor<[],si64>, %arg30: !torch.vtensor<[256],f32>, %arg31: !torch.vtensor<[256],f32>, %arg32: !torch.vtensor<[],si64>, %arg33: !torch.vtensor<[512],f32>, %arg34: !torch.vtensor<[512],f32>, %arg35: !torch.vtensor<[],si64>, %arg36: !torch.vtensor<[128],f32>, %arg37: !torch.vtensor<[128],f32>, %arg38: !torch.vtensor<[],si64>, %arg39: !torch.vtensor<[128],f32>, %arg40: !torch.vtensor<[128],f32>, %arg41: !torch.vtensor<[],si64>, %arg42: !torch.vtensor<[512],f32>, %arg43: !torch.vtensor<[512],f32>, %arg44: !torch.vtensor<[],si64>, %arg45: !torch.vtensor<[128],f32>, %arg46: !torch.vtensor<[128],f32>, %arg47: !torch.vtensor<[],si64>, %arg48: !torch.vtensor<[128],f32>, %arg49: !torch.vtensor<[128],f32>, %arg50: !torch.vtensor<[],si64>, %arg51: !torch.vtensor<[512],f32>, %arg52: !torch.vtensor<[512],f32>, %arg53: !torch.vtensor<[],si64>, %arg54: !torch.vtensor<[128],f32>, %arg55: !torch.vtensor<[128],f32>, %arg56: !torch.vtensor<[],si64>, %arg57: !torch.vtensor<[128],f32>, %arg58: !torch.vtensor<[128],f32>, %arg59: !torch.vtensor<[],si64>, %arg60: !torch.vtensor<[512],f32>, %arg61: !torch.vtensor<[512],f32>, %arg62: !torch.vtensor<[],si64>, %arg63: !torch.vtensor<[128],f32>, %arg64: !torch.vtensor<[128],f32>, %arg65: !torch.vtensor<[],si64>, %arg66: !torch.vtensor<[128],f32>, %arg67: !torch.vtensor<[128],f32>, %arg68: !torch.vtensor<[],si64>, %arg69: !torch.vtensor<[512],f32>, %arg70: !torch.vtensor<[512],f32>, %arg71: !torch.vtensor<[],si64>, %arg72: !torch.vtensor<[1024],f32>, %arg73: !torch.vtensor<[1024],f32>, %arg74: !torch.vtensor<[],si64>, %arg75: !torch.vtensor<[256],f32>, %arg76: !torch.vtensor<[256],f32>, %arg77: !torch.vtensor<[],si64>, %arg78: !torch.vtensor<[256],f32>, %arg79: !torch.vtensor<[256],f32>, %arg80: !torch.vtensor<[],si64>, %arg81: !torch.vtensor<[1024],f32>, %arg82: !torch.vtensor<[1024],f32>, %arg83: !torch.vtensor<[],si64>, %arg84: !torch.vtensor<[256],f32>, %arg85: !torch.vtensor<[256],f32>, %arg86: !torch.vtensor<[],si64>, %arg87: !torch.vtensor<[256],f32>, %arg88: !torch.vtensor<[256],f32>, %arg89: !torch.vtensor<[],si64>, %arg90: !torch.vtensor<[1024],f32>, %arg91: !torch.vtensor<[1024],f32>, %arg92: !torch.vtensor<[],si64>, %arg93: !torch.vtensor<[256],f32>, %arg94: !torch.vtensor<[256],f32>, %arg95: !torch.vtensor<[],si64>, %arg96: !torch.vtensor<[256],f32>, %arg97: !torch.vtensor<[256],f32>, %arg98: !torch.vtensor<[],si64>, %arg99: !torch.vtensor<[1024],f32>, %arg100: !torch.vtensor<[1024],f32>, %arg101: !torch.vtensor<[],si64>, %arg102: !torch.vtensor<[256],f32>, %arg103: !torch.vtensor<[256],f32>, %arg104: !torch.vtensor<[],si64>, %arg105: !torch.vtensor<[256],f32>, %arg106: !torch.vtensor<[256],f32>, %arg107: !torch.vtensor<[],si64>, %arg108: !torch.vtensor<[1024],f32>, %arg109: !torch.vtensor<[1024],f32>, %arg110: !torch.vtensor<[],si64>, %arg111: !torch.vtensor<[256],f32>, %arg112: !torch.vtensor<[256],f32>, %arg113: !torch.vtensor<[],si64>, %arg114: !torch.vtensor<[256],f32>, %arg115: !torch.vtensor<[256],f32>, %arg116: !torch.vtensor<[],si64>, %arg117: !torch.vtensor<[1024],f32>, %arg118: !torch.vtensor<[1024],f32>, %arg119: !torch.vtensor<[],si64>, %arg120: !torch.vtensor<[256],f32>, %arg121: !torch.vtensor<[256],f32>, %arg122: !torch.vtensor<[],si64>, %arg123: !torch.vtensor<[256],f32>, %arg124: !torch.vtensor<[256],f32>, %arg125: !torch.vtensor<[],si64>, %arg126: !torch.vtensor<[1024],f32>, %arg127: !torch.vtensor<[1024],f32>, %arg128: !torch.vtensor<[],si64>, %arg129: !torch.vtensor<[2048],f32>, %arg130: !torch.vtensor<[2048],f32>, %arg131: !torch.vtensor<[],si64>, %arg132: !torch.vtensor<[512],f32>, %arg133: !torch.vtensor<[512],f32>, %arg134: !torch.vtensor<[],si64>, %arg135: !torch.vtensor<[512],f32>, %arg136: !torch.vtensor<[512],f32>, %arg137: !torch.vtensor<[],si64>, %arg138: !torch.vtensor<[2048],f32>, %arg139: !torch.vtensor<[2048],f32>, %arg140: !torch.vtensor<[],si64>, %arg141: !torch.vtensor<[512],f32>, %arg142: !torch.vtensor<[512],f32>, %arg143: !torch.vtensor<[],si64>, %arg144: !torch.vtensor<[512],f32>, %arg145: !torch.vtensor<[512],f32>, %arg146: !torch.vtensor<[],si64>, %arg147: !torch.vtensor<[2048],f32>, %arg148: !torch.vtensor<[2048],f32>, %arg149: !torch.vtensor<[],si64>, %arg150: !torch.vtensor<[512],f32>, %arg151: !torch.vtensor<[512],f32>, %arg152: !torch.vtensor<[],si64>, %arg153: !torch.vtensor<[512],f32>, %arg154: !torch.vtensor<[512],f32>, %arg155: !torch.vtensor<[],si64>, %arg156: !torch.vtensor<[2048],f32>, %arg157: !torch.vtensor<[2048],f32>, %arg158: !torch.vtensor<[],si64>, %arg159: !torch.vtensor<[3,3,512,512],f32>) -> (!torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[128],f32>, !torch.vtensor<[128],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1024],f32>, !torch.vtensor<[1024],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[2048],f32>, !torch.vtensor<[2048],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[2048],f32>, !torch.vtensor<[2048],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[2048],f32>, !torch.vtensor<[2048],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[512],f32>, !torch.vtensor<[512],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[2048],f32>, !torch.vtensor<[2048],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[3,1000],f32>) {
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_64_3_7_7_torch.float32> : tensor<64x3x7x7xf32>) : !torch.vtensor<[64,3,7,7],f32>
    %none = torch.constant.none
    %int2 = torch.constant.int 2
    %int2_0 = torch.constant.int 2
    %1 = torch.prim.ListConstruct %int2, %int2_0 : (!torch.int, !torch.int) -> !torch.list<int>
    %int3 = torch.constant.int 3
    %int3_1 = torch.constant.int 3
    %2 = torch.prim.ListConstruct %int3, %int3_1 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1 = torch.constant.int 1
    %int1_2 = torch.constant.int 1
    %3 = torch.prim.ListConstruct %int1, %int1_2 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_3 = torch.constant.int 1
    %4 = torch.aten.conv2d %arg159, %0, %none, %1, %2, %3, %int1_3 : !torch.vtensor<[3,3,512,512],f32>, !torch.vtensor<[64,3,7,7],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[3,64,256,256],f32>
    %int1_4 = torch.constant.int 1
    %int1_5 = torch.constant.int 1
    %5 = torch.aten.add.Scalar %arg2, %int1_4, %int1_5 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %int0 = torch.constant.int 0
    %int2_6 = torch.constant.int 2
    %int3_7 = torch.constant.int 3
    %6 = torch.prim.ListConstruct %int0, %int2_6, %int3_7 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_8 = torch.constant.int 0
    %true = torch.constant.bool true
    %result0, %result1 = torch.aten.var_mean.correction %4, %6, %int0_8, %true : !torch.vtensor<[3,64,256,256],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,64,1,1],f32>, !torch.vtensor<[1,64,1,1],f32>
    %float1.000000e-05 = torch.constant.float 1.000000e-05
    %int1_9 = torch.constant.int 1
    %7 = torch.aten.add.Scalar %result0, %float1.000000e-05, %int1_9 : !torch.vtensor<[1,64,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,1,1],f32>
    %8 = torch.aten.rsqrt %7 : !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[1,64,1,1],f32>
    %int1_10 = torch.constant.int 1
    %9 = torch.aten.sub.Tensor %4, %result1, %int1_10 : !torch.vtensor<[3,64,256,256],f32>, !torch.vtensor<[1,64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,256,256],f32>
    %10 = torch.aten.mul.Tensor %9, %8 : !torch.vtensor<[3,64,256,256],f32>, !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[3,64,256,256],f32>
    %int3_11 = torch.constant.int 3
    %11 = torch.prim.ListConstruct %int3_11 : (!torch.int) -> !torch.list<int>
    %12 = torch.prims.squeeze %result1, %11 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_12 = torch.constant.int 2
    %13 = torch.prim.ListConstruct %int2_12 : (!torch.int) -> !torch.list<int>
    %14 = torch.prims.squeeze %12, %13 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_13 = torch.constant.int 0
    %15 = torch.prim.ListConstruct %int0_13 : (!torch.int) -> !torch.list<int>
    %16 = torch.prims.squeeze %14, %15 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000000e-01 = torch.constant.float 1.000000e-01
    %17 = torch.aten.mul.Scalar %16, %float1.000000e-01 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01 = torch.constant.float 9.000000e-01
    %18 = torch.aten.mul.Scalar %arg0, %float9.000000e-01 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_14 = torch.constant.int 1
    %19 = torch.aten.add.Tensor %17, %18, %int1_14 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %int3_15 = torch.constant.int 3
    %20 = torch.prim.ListConstruct %int3_15 : (!torch.int) -> !torch.list<int>
    %21 = torch.prims.squeeze %result0, %20 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_16 = torch.constant.int 2
    %22 = torch.prim.ListConstruct %int2_16 : (!torch.int) -> !torch.list<int>
    %23 = torch.prims.squeeze %21, %22 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_17 = torch.constant.int 0
    %24 = torch.prim.ListConstruct %int0_17 : (!torch.int) -> !torch.list<int>
    %25 = torch.prims.squeeze %23, %24 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000010e00 = torch.constant.float 1.000005086288891
    %26 = torch.aten.mul.Scalar %25, %float1.000010e00 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float1.000000e-01_18 = torch.constant.float 1.000000e-01
    %27 = torch.aten.mul.Scalar %26, %float1.000000e-01_18 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_19 = torch.constant.float 9.000000e-01
    %28 = torch.aten.mul.Scalar %arg1, %float9.000000e-01_19 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_20 = torch.constant.int 1
    %29 = torch.aten.add.Tensor %27, %28, %int1_20 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %30 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1 = torch.constant.int -1
    %31 = torch.aten.unsqueeze %30, %int-1 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_21 = torch.constant.int -1
    %32 = torch.aten.unsqueeze %31, %int-1_21 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %33 = torch.aten.mul.Tensor %10, %32 : !torch.vtensor<[3,64,256,256],f32>, !torch.vtensor<[64,1,1],f32> -> !torch.vtensor<[3,64,256,256],f32>
    %34 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_1> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_22 = torch.constant.int -1
    %35 = torch.aten.unsqueeze %34, %int-1_22 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_23 = torch.constant.int -1
    %36 = torch.aten.unsqueeze %35, %int-1_23 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %int1_24 = torch.constant.int 1
    %37 = torch.aten.add.Tensor %33, %36, %int1_24 : !torch.vtensor<[3,64,256,256],f32>, !torch.vtensor<[64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,256,256],f32>
    %38 = torch.aten.relu %37 : !torch.vtensor<[3,64,256,256],f32> -> !torch.vtensor<[3,64,256,256],f32>
    %int3_25 = torch.constant.int 3
    %int3_26 = torch.constant.int 3
    %39 = torch.prim.ListConstruct %int3_25, %int3_26 : (!torch.int, !torch.int) -> !torch.list<int>
    %int2_27 = torch.constant.int 2
    %int2_28 = torch.constant.int 2
    %40 = torch.prim.ListConstruct %int2_27, %int2_28 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_29 = torch.constant.int 1
    %int1_30 = torch.constant.int 1
    %41 = torch.prim.ListConstruct %int1_29, %int1_30 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_31 = torch.constant.int 1
    %int1_32 = torch.constant.int 1
    %42 = torch.prim.ListConstruct %int1_31, %int1_32 : (!torch.int, !torch.int) -> !torch.list<int>
    %false = torch.constant.bool false
    %43 = torch.aten.max_pool2d %38, %39, %40, %41, %42, %false : !torch.vtensor<[3,64,256,256],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool -> !torch.vtensor<[3,64,128,128],f32>
    %44 = torch.vtensor.literal(dense_resource<torch_tensor_256_64_1_1_torch.float32> : tensor<256x64x1x1xf32>) : !torch.vtensor<[256,64,1,1],f32>
    %none_33 = torch.constant.none
    %int1_34 = torch.constant.int 1
    %int1_35 = torch.constant.int 1
    %45 = torch.prim.ListConstruct %int1_34, %int1_35 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_36 = torch.constant.int 0
    %int0_37 = torch.constant.int 0
    %46 = torch.prim.ListConstruct %int0_36, %int0_37 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_38 = torch.constant.int 1
    %int1_39 = torch.constant.int 1
    %47 = torch.prim.ListConstruct %int1_38, %int1_39 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_40 = torch.constant.int 1
    %48 = torch.aten.conv2d %43, %44, %none_33, %45, %46, %47, %int1_40 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[256,64,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %int1_41 = torch.constant.int 1
    %int1_42 = torch.constant.int 1
    %49 = torch.aten.add.Scalar %arg5, %int1_41, %int1_42 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %int0_43 = torch.constant.int 0
    %int2_44 = torch.constant.int 2
    %int3_45 = torch.constant.int 3
    %50 = torch.prim.ListConstruct %int0_43, %int2_44, %int3_45 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_46 = torch.constant.int 0
    %true_47 = torch.constant.bool true
    %result0_48, %result1_49 = torch.aten.var_mean.correction %48, %50, %int0_46, %true_47 : !torch.vtensor<[3,256,128,128],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,256,1,1],f32>, !torch.vtensor<[1,256,1,1],f32>
    %float1.000000e-05_50 = torch.constant.float 1.000000e-05
    %int1_51 = torch.constant.int 1
    %51 = torch.aten.add.Scalar %result0_48, %float1.000000e-05_50, %int1_51 : !torch.vtensor<[1,256,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,256,1,1],f32>
    %52 = torch.aten.rsqrt %51 : !torch.vtensor<[1,256,1,1],f32> -> !torch.vtensor<[1,256,1,1],f32>
    %int1_52 = torch.constant.int 1
    %53 = torch.aten.sub.Tensor %48, %result1_49, %int1_52 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[1,256,1,1],f32>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %54 = torch.aten.mul.Tensor %53, %52 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[1,256,1,1],f32> -> !torch.vtensor<[3,256,128,128],f32>
    %int3_53 = torch.constant.int 3
    %55 = torch.prim.ListConstruct %int3_53 : (!torch.int) -> !torch.list<int>
    %56 = torch.prims.squeeze %result1_49, %55 : !torch.vtensor<[1,256,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256,1],f32>
    %int2_54 = torch.constant.int 2
    %57 = torch.prim.ListConstruct %int2_54 : (!torch.int) -> !torch.list<int>
    %58 = torch.prims.squeeze %56, %57 : !torch.vtensor<[1,256,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256],f32>
    %int0_55 = torch.constant.int 0
    %59 = torch.prim.ListConstruct %int0_55 : (!torch.int) -> !torch.list<int>
    %60 = torch.prims.squeeze %58, %59 : !torch.vtensor<[1,256],f32>, !torch.list<int> -> !torch.vtensor<[256],f32>
    %float1.000000e-01_56 = torch.constant.float 1.000000e-01
    %61 = torch.aten.mul.Scalar %60, %float1.000000e-01_56 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %float9.000000e-01_57 = torch.constant.float 9.000000e-01
    %62 = torch.aten.mul.Scalar %arg3, %float9.000000e-01_57 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %int1_58 = torch.constant.int 1
    %63 = torch.aten.add.Tensor %61, %62, %int1_58 : !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256],f32>
    %int3_59 = torch.constant.int 3
    %64 = torch.prim.ListConstruct %int3_59 : (!torch.int) -> !torch.list<int>
    %65 = torch.prims.squeeze %result0_48, %64 : !torch.vtensor<[1,256,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256,1],f32>
    %int2_60 = torch.constant.int 2
    %66 = torch.prim.ListConstruct %int2_60 : (!torch.int) -> !torch.list<int>
    %67 = torch.prims.squeeze %65, %66 : !torch.vtensor<[1,256,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256],f32>
    %int0_61 = torch.constant.int 0
    %68 = torch.prim.ListConstruct %int0_61 : (!torch.int) -> !torch.list<int>
    %69 = torch.prims.squeeze %67, %68 : !torch.vtensor<[1,256],f32>, !torch.list<int> -> !torch.vtensor<[256],f32>
    %float1.000020e00 = torch.constant.float 1.0000203454660128
    %70 = torch.aten.mul.Scalar %69, %float1.000020e00 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %float1.000000e-01_62 = torch.constant.float 1.000000e-01
    %71 = torch.aten.mul.Scalar %70, %float1.000000e-01_62 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %float9.000000e-01_63 = torch.constant.float 9.000000e-01
    %72 = torch.aten.mul.Scalar %arg4, %float9.000000e-01_63 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %int1_64 = torch.constant.int 1
    %73 = torch.aten.add.Tensor %71, %72, %int1_64 : !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256],f32>
    %74 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %int-1_65 = torch.constant.int -1
    %75 = torch.aten.unsqueeze %74, %int-1_65 : !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256,1],f32>
    %int-1_66 = torch.constant.int -1
    %76 = torch.aten.unsqueeze %75, %int-1_66 : !torch.vtensor<[256,1],f32>, !torch.int -> !torch.vtensor<[256,1,1],f32>
    %77 = torch.aten.mul.Tensor %54, %76 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[256,1,1],f32> -> !torch.vtensor<[3,256,128,128],f32>
    %78 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_1> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %int-1_67 = torch.constant.int -1
    %79 = torch.aten.unsqueeze %78, %int-1_67 : !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256,1],f32>
    %int-1_68 = torch.constant.int -1
    %80 = torch.aten.unsqueeze %79, %int-1_68 : !torch.vtensor<[256,1],f32>, !torch.int -> !torch.vtensor<[256,1,1],f32>
    %int1_69 = torch.constant.int 1
    %81 = torch.aten.add.Tensor %77, %80, %int1_69 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[256,1,1],f32>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %82 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_1_1_torch.float32> : tensor<64x64x1x1xf32>) : !torch.vtensor<[64,64,1,1],f32>
    %none_70 = torch.constant.none
    %int1_71 = torch.constant.int 1
    %int1_72 = torch.constant.int 1
    %83 = torch.prim.ListConstruct %int1_71, %int1_72 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_73 = torch.constant.int 0
    %int0_74 = torch.constant.int 0
    %84 = torch.prim.ListConstruct %int0_73, %int0_74 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_75 = torch.constant.int 1
    %int1_76 = torch.constant.int 1
    %85 = torch.prim.ListConstruct %int1_75, %int1_76 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_77 = torch.constant.int 1
    %86 = torch.aten.conv2d %43, %82, %none_70, %83, %84, %85, %int1_77 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,64,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %int1_78 = torch.constant.int 1
    %int1_79 = torch.constant.int 1
    %87 = torch.aten.add.Scalar %arg8, %int1_78, %int1_79 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %int0_80 = torch.constant.int 0
    %int2_81 = torch.constant.int 2
    %int3_82 = torch.constant.int 3
    %88 = torch.prim.ListConstruct %int0_80, %int2_81, %int3_82 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_83 = torch.constant.int 0
    %true_84 = torch.constant.bool true
    %result0_85, %result1_86 = torch.aten.var_mean.correction %86, %88, %int0_83, %true_84 : !torch.vtensor<[3,64,128,128],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,64,1,1],f32>, !torch.vtensor<[1,64,1,1],f32>
    %float1.000000e-05_87 = torch.constant.float 1.000000e-05
    %int1_88 = torch.constant.int 1
    %89 = torch.aten.add.Scalar %result0_85, %float1.000000e-05_87, %int1_88 : !torch.vtensor<[1,64,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,1,1],f32>
    %90 = torch.aten.rsqrt %89 : !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[1,64,1,1],f32>
    %int1_89 = torch.constant.int 1
    %91 = torch.aten.sub.Tensor %86, %result1_86, %int1_89 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[1,64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %92 = torch.aten.mul.Tensor %91, %90 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %int3_90 = torch.constant.int 3
    %93 = torch.prim.ListConstruct %int3_90 : (!torch.int) -> !torch.list<int>
    %94 = torch.prims.squeeze %result1_86, %93 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_91 = torch.constant.int 2
    %95 = torch.prim.ListConstruct %int2_91 : (!torch.int) -> !torch.list<int>
    %96 = torch.prims.squeeze %94, %95 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_92 = torch.constant.int 0
    %97 = torch.prim.ListConstruct %int0_92 : (!torch.int) -> !torch.list<int>
    %98 = torch.prims.squeeze %96, %97 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000000e-01_93 = torch.constant.float 1.000000e-01
    %99 = torch.aten.mul.Scalar %98, %float1.000000e-01_93 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_94 = torch.constant.float 9.000000e-01
    %100 = torch.aten.mul.Scalar %arg6, %float9.000000e-01_94 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_95 = torch.constant.int 1
    %101 = torch.aten.add.Tensor %99, %100, %int1_95 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %int3_96 = torch.constant.int 3
    %102 = torch.prim.ListConstruct %int3_96 : (!torch.int) -> !torch.list<int>
    %103 = torch.prims.squeeze %result0_85, %102 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_97 = torch.constant.int 2
    %104 = torch.prim.ListConstruct %int2_97 : (!torch.int) -> !torch.list<int>
    %105 = torch.prims.squeeze %103, %104 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_98 = torch.constant.int 0
    %106 = torch.prim.ListConstruct %int0_98 : (!torch.int) -> !torch.list<int>
    %107 = torch.prims.squeeze %105, %106 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000020e00_99 = torch.constant.float 1.0000203454660128
    %108 = torch.aten.mul.Scalar %107, %float1.000020e00_99 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float1.000000e-01_100 = torch.constant.float 1.000000e-01
    %109 = torch.aten.mul.Scalar %108, %float1.000000e-01_100 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_101 = torch.constant.float 9.000000e-01
    %110 = torch.aten.mul.Scalar %arg7, %float9.000000e-01_101 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_102 = torch.constant.int 1
    %111 = torch.aten.add.Tensor %109, %110, %int1_102 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %112 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_2> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_103 = torch.constant.int -1
    %113 = torch.aten.unsqueeze %112, %int-1_103 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_104 = torch.constant.int -1
    %114 = torch.aten.unsqueeze %113, %int-1_104 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %115 = torch.aten.mul.Tensor %92, %114 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,1,1],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %116 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_3> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_105 = torch.constant.int -1
    %117 = torch.aten.unsqueeze %116, %int-1_105 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_106 = torch.constant.int -1
    %118 = torch.aten.unsqueeze %117, %int-1_106 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %int1_107 = torch.constant.int 1
    %119 = torch.aten.add.Tensor %115, %118, %int1_107 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %120 = torch.aten.relu %119 : !torch.vtensor<[3,64,128,128],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %121 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_3_3_torch.float32> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %none_108 = torch.constant.none
    %int1_109 = torch.constant.int 1
    %int1_110 = torch.constant.int 1
    %122 = torch.prim.ListConstruct %int1_109, %int1_110 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_111 = torch.constant.int 1
    %int1_112 = torch.constant.int 1
    %123 = torch.prim.ListConstruct %int1_111, %int1_112 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_113 = torch.constant.int 1
    %int1_114 = torch.constant.int 1
    %124 = torch.prim.ListConstruct %int1_113, %int1_114 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_115 = torch.constant.int 1
    %125 = torch.aten.conv2d %120, %121, %none_108, %122, %123, %124, %int1_115 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,64,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %int1_116 = torch.constant.int 1
    %int1_117 = torch.constant.int 1
    %126 = torch.aten.add.Scalar %arg11, %int1_116, %int1_117 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %int0_118 = torch.constant.int 0
    %int2_119 = torch.constant.int 2
    %int3_120 = torch.constant.int 3
    %127 = torch.prim.ListConstruct %int0_118, %int2_119, %int3_120 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_121 = torch.constant.int 0
    %true_122 = torch.constant.bool true
    %result0_123, %result1_124 = torch.aten.var_mean.correction %125, %127, %int0_121, %true_122 : !torch.vtensor<[3,64,128,128],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,64,1,1],f32>, !torch.vtensor<[1,64,1,1],f32>
    %float1.000000e-05_125 = torch.constant.float 1.000000e-05
    %int1_126 = torch.constant.int 1
    %128 = torch.aten.add.Scalar %result0_123, %float1.000000e-05_125, %int1_126 : !torch.vtensor<[1,64,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,1,1],f32>
    %129 = torch.aten.rsqrt %128 : !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[1,64,1,1],f32>
    %int1_127 = torch.constant.int 1
    %130 = torch.aten.sub.Tensor %125, %result1_124, %int1_127 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[1,64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %131 = torch.aten.mul.Tensor %130, %129 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %int3_128 = torch.constant.int 3
    %132 = torch.prim.ListConstruct %int3_128 : (!torch.int) -> !torch.list<int>
    %133 = torch.prims.squeeze %result1_124, %132 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_129 = torch.constant.int 2
    %134 = torch.prim.ListConstruct %int2_129 : (!torch.int) -> !torch.list<int>
    %135 = torch.prims.squeeze %133, %134 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_130 = torch.constant.int 0
    %136 = torch.prim.ListConstruct %int0_130 : (!torch.int) -> !torch.list<int>
    %137 = torch.prims.squeeze %135, %136 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000000e-01_131 = torch.constant.float 1.000000e-01
    %138 = torch.aten.mul.Scalar %137, %float1.000000e-01_131 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_132 = torch.constant.float 9.000000e-01
    %139 = torch.aten.mul.Scalar %arg9, %float9.000000e-01_132 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_133 = torch.constant.int 1
    %140 = torch.aten.add.Tensor %138, %139, %int1_133 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %int3_134 = torch.constant.int 3
    %141 = torch.prim.ListConstruct %int3_134 : (!torch.int) -> !torch.list<int>
    %142 = torch.prims.squeeze %result0_123, %141 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_135 = torch.constant.int 2
    %143 = torch.prim.ListConstruct %int2_135 : (!torch.int) -> !torch.list<int>
    %144 = torch.prims.squeeze %142, %143 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_136 = torch.constant.int 0
    %145 = torch.prim.ListConstruct %int0_136 : (!torch.int) -> !torch.list<int>
    %146 = torch.prims.squeeze %144, %145 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000020e00_137 = torch.constant.float 1.0000203454660128
    %147 = torch.aten.mul.Scalar %146, %float1.000020e00_137 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float1.000000e-01_138 = torch.constant.float 1.000000e-01
    %148 = torch.aten.mul.Scalar %147, %float1.000000e-01_138 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_139 = torch.constant.float 9.000000e-01
    %149 = torch.aten.mul.Scalar %arg10, %float9.000000e-01_139 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_140 = torch.constant.int 1
    %150 = torch.aten.add.Tensor %148, %149, %int1_140 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %151 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_4> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_141 = torch.constant.int -1
    %152 = torch.aten.unsqueeze %151, %int-1_141 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_142 = torch.constant.int -1
    %153 = torch.aten.unsqueeze %152, %int-1_142 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %154 = torch.aten.mul.Tensor %131, %153 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,1,1],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %155 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_5> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_143 = torch.constant.int -1
    %156 = torch.aten.unsqueeze %155, %int-1_143 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_144 = torch.constant.int -1
    %157 = torch.aten.unsqueeze %156, %int-1_144 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %int1_145 = torch.constant.int 1
    %158 = torch.aten.add.Tensor %154, %157, %int1_145 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %159 = torch.aten.relu %158 : !torch.vtensor<[3,64,128,128],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %160 = torch.vtensor.literal(dense_resource<torch_tensor_256_64_1_1_torch.float32_1> : tensor<256x64x1x1xf32>) : !torch.vtensor<[256,64,1,1],f32>
    %none_146 = torch.constant.none
    %int1_147 = torch.constant.int 1
    %int1_148 = torch.constant.int 1
    %161 = torch.prim.ListConstruct %int1_147, %int1_148 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_149 = torch.constant.int 0
    %int0_150 = torch.constant.int 0
    %162 = torch.prim.ListConstruct %int0_149, %int0_150 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_151 = torch.constant.int 1
    %int1_152 = torch.constant.int 1
    %163 = torch.prim.ListConstruct %int1_151, %int1_152 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_153 = torch.constant.int 1
    %164 = torch.aten.conv2d %159, %160, %none_146, %161, %162, %163, %int1_153 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[256,64,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %int1_154 = torch.constant.int 1
    %int1_155 = torch.constant.int 1
    %165 = torch.aten.add.Scalar %arg14, %int1_154, %int1_155 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %int0_156 = torch.constant.int 0
    %int2_157 = torch.constant.int 2
    %int3_158 = torch.constant.int 3
    %166 = torch.prim.ListConstruct %int0_156, %int2_157, %int3_158 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_159 = torch.constant.int 0
    %true_160 = torch.constant.bool true
    %result0_161, %result1_162 = torch.aten.var_mean.correction %164, %166, %int0_159, %true_160 : !torch.vtensor<[3,256,128,128],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,256,1,1],f32>, !torch.vtensor<[1,256,1,1],f32>
    %float1.000000e-05_163 = torch.constant.float 1.000000e-05
    %int1_164 = torch.constant.int 1
    %167 = torch.aten.add.Scalar %result0_161, %float1.000000e-05_163, %int1_164 : !torch.vtensor<[1,256,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,256,1,1],f32>
    %168 = torch.aten.rsqrt %167 : !torch.vtensor<[1,256,1,1],f32> -> !torch.vtensor<[1,256,1,1],f32>
    %int1_165 = torch.constant.int 1
    %169 = torch.aten.sub.Tensor %164, %result1_162, %int1_165 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[1,256,1,1],f32>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %170 = torch.aten.mul.Tensor %169, %168 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[1,256,1,1],f32> -> !torch.vtensor<[3,256,128,128],f32>
    %int3_166 = torch.constant.int 3
    %171 = torch.prim.ListConstruct %int3_166 : (!torch.int) -> !torch.list<int>
    %172 = torch.prims.squeeze %result1_162, %171 : !torch.vtensor<[1,256,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256,1],f32>
    %int2_167 = torch.constant.int 2
    %173 = torch.prim.ListConstruct %int2_167 : (!torch.int) -> !torch.list<int>
    %174 = torch.prims.squeeze %172, %173 : !torch.vtensor<[1,256,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256],f32>
    %int0_168 = torch.constant.int 0
    %175 = torch.prim.ListConstruct %int0_168 : (!torch.int) -> !torch.list<int>
    %176 = torch.prims.squeeze %174, %175 : !torch.vtensor<[1,256],f32>, !torch.list<int> -> !torch.vtensor<[256],f32>
    %float1.000000e-01_169 = torch.constant.float 1.000000e-01
    %177 = torch.aten.mul.Scalar %176, %float1.000000e-01_169 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %float9.000000e-01_170 = torch.constant.float 9.000000e-01
    %178 = torch.aten.mul.Scalar %arg12, %float9.000000e-01_170 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %int1_171 = torch.constant.int 1
    %179 = torch.aten.add.Tensor %177, %178, %int1_171 : !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256],f32>
    %int3_172 = torch.constant.int 3
    %180 = torch.prim.ListConstruct %int3_172 : (!torch.int) -> !torch.list<int>
    %181 = torch.prims.squeeze %result0_161, %180 : !torch.vtensor<[1,256,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256,1],f32>
    %int2_173 = torch.constant.int 2
    %182 = torch.prim.ListConstruct %int2_173 : (!torch.int) -> !torch.list<int>
    %183 = torch.prims.squeeze %181, %182 : !torch.vtensor<[1,256,1],f32>, !torch.list<int> -> !torch.vtensor<[1,256],f32>
    %int0_174 = torch.constant.int 0
    %184 = torch.prim.ListConstruct %int0_174 : (!torch.int) -> !torch.list<int>
    %185 = torch.prims.squeeze %183, %184 : !torch.vtensor<[1,256],f32>, !torch.list<int> -> !torch.vtensor<[256],f32>
    %float1.000020e00_175 = torch.constant.float 1.0000203454660128
    %186 = torch.aten.mul.Scalar %185, %float1.000020e00_175 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %float1.000000e-01_176 = torch.constant.float 1.000000e-01
    %187 = torch.aten.mul.Scalar %186, %float1.000000e-01_176 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %float9.000000e-01_177 = torch.constant.float 9.000000e-01
    %188 = torch.aten.mul.Scalar %arg13, %float9.000000e-01_177 : !torch.vtensor<[256],f32>, !torch.float -> !torch.vtensor<[256],f32>
    %int1_178 = torch.constant.int 1
    %189 = torch.aten.add.Tensor %187, %188, %int1_178 : !torch.vtensor<[256],f32>, !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256],f32>
    %190 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_2> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %int-1_179 = torch.constant.int -1
    %191 = torch.aten.unsqueeze %190, %int-1_179 : !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256,1],f32>
    %int-1_180 = torch.constant.int -1
    %192 = torch.aten.unsqueeze %191, %int-1_180 : !torch.vtensor<[256,1],f32>, !torch.int -> !torch.vtensor<[256,1,1],f32>
    %193 = torch.aten.mul.Tensor %170, %192 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[256,1,1],f32> -> !torch.vtensor<[3,256,128,128],f32>
    %194 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_3> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %int-1_181 = torch.constant.int -1
    %195 = torch.aten.unsqueeze %194, %int-1_181 : !torch.vtensor<[256],f32>, !torch.int -> !torch.vtensor<[256,1],f32>
    %int-1_182 = torch.constant.int -1
    %196 = torch.aten.unsqueeze %195, %int-1_182 : !torch.vtensor<[256,1],f32>, !torch.int -> !torch.vtensor<[256,1,1],f32>
    %int1_183 = torch.constant.int 1
    %197 = torch.aten.add.Tensor %193, %196, %int1_183 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[256,1,1],f32>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %int1_184 = torch.constant.int 1
    %198 = torch.aten.add.Tensor %197, %81, %int1_184 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[3,256,128,128],f32>, !torch.int -> !torch.vtensor<[3,256,128,128],f32>
    %199 = torch.aten.relu %198 : !torch.vtensor<[3,256,128,128],f32> -> !torch.vtensor<[3,256,128,128],f32>
    %200 = torch.vtensor.literal(dense_resource<torch_tensor_64_256_1_1_torch.float32> : tensor<64x256x1x1xf32>) : !torch.vtensor<[64,256,1,1],f32>
    %none_185 = torch.constant.none
    %int1_186 = torch.constant.int 1
    %int1_187 = torch.constant.int 1
    %201 = torch.prim.ListConstruct %int1_186, %int1_187 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_188 = torch.constant.int 0
    %int0_189 = torch.constant.int 0
    %202 = torch.prim.ListConstruct %int0_188, %int0_189 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_190 = torch.constant.int 1
    %int1_191 = torch.constant.int 1
    %203 = torch.prim.ListConstruct %int1_190, %int1_191 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_192 = torch.constant.int 1
    %204 = torch.aten.conv2d %199, %200, %none_185, %201, %202, %203, %int1_192 : !torch.vtensor<[3,256,128,128],f32>, !torch.vtensor<[64,256,1,1],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %int1_193 = torch.constant.int 1
    %int1_194 = torch.constant.int 1
    %205 = torch.aten.add.Scalar %arg17, %int1_193, %int1_194 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %int0_195 = torch.constant.int 0
    %int2_196 = torch.constant.int 2
    %int3_197 = torch.constant.int 3
    %206 = torch.prim.ListConstruct %int0_195, %int2_196, %int3_197 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %int0_198 = torch.constant.int 0
    %true_199 = torch.constant.bool true
    %result0_200, %result1_201 = torch.aten.var_mean.correction %204, %206, %int0_198, %true_199 : !torch.vtensor<[3,64,128,128],f32>, !torch.list<int>, !torch.int, !torch.bool -> !torch.vtensor<[1,64,1,1],f32>, !torch.vtensor<[1,64,1,1],f32>
    %float1.000000e-05_202 = torch.constant.float 1.000000e-05
    %int1_203 = torch.constant.int 1
    %207 = torch.aten.add.Scalar %result0_200, %float1.000000e-05_202, %int1_203 : !torch.vtensor<[1,64,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,1,1],f32>
    %208 = torch.aten.rsqrt %207 : !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[1,64,1,1],f32>
    %int1_204 = torch.constant.int 1
    %209 = torch.aten.sub.Tensor %204, %result1_201, %int1_204 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[1,64,1,1],f32>, !torch.int -> !torch.vtensor<[3,64,128,128],f32>
    %210 = torch.aten.mul.Tensor %209, %208 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[1,64,1,1],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %int3_205 = torch.constant.int 3
    %211 = torch.prim.ListConstruct %int3_205 : (!torch.int) -> !torch.list<int>
    %212 = torch.prims.squeeze %result1_201, %211 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_206 = torch.constant.int 2
    %213 = torch.prim.ListConstruct %int2_206 : (!torch.int) -> !torch.list<int>
    %214 = torch.prims.squeeze %212, %213 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_207 = torch.constant.int 0
    %215 = torch.prim.ListConstruct %int0_207 : (!torch.int) -> !torch.list<int>
    %216 = torch.prims.squeeze %214, %215 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000000e-01_208 = torch.constant.float 1.000000e-01
    %217 = torch.aten.mul.Scalar %216, %float1.000000e-01_208 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_209 = torch.constant.float 9.000000e-01
    %218 = torch.aten.mul.Scalar %arg15, %float9.000000e-01_209 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_210 = torch.constant.int 1
    %219 = torch.aten.add.Tensor %217, %218, %int1_210 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %int3_211 = torch.constant.int 3
    %220 = torch.prim.ListConstruct %int3_211 : (!torch.int) -> !torch.list<int>
    %221 = torch.prims.squeeze %result0_200, %220 : !torch.vtensor<[1,64,1,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64,1],f32>
    %int2_212 = torch.constant.int 2
    %222 = torch.prim.ListConstruct %int2_212 : (!torch.int) -> !torch.list<int>
    %223 = torch.prims.squeeze %221, %222 : !torch.vtensor<[1,64,1],f32>, !torch.list<int> -> !torch.vtensor<[1,64],f32>
    %int0_213 = torch.constant.int 0
    %224 = torch.prim.ListConstruct %int0_213 : (!torch.int) -> !torch.list<int>
    %225 = torch.prims.squeeze %223, %224 : !torch.vtensor<[1,64],f32>, !torch.list<int> -> !torch.vtensor<[64],f32>
    %float1.000020e00_214 = torch.constant.float 1.0000203454660128
    %226 = torch.aten.mul.Scalar %225, %float1.000020e00_214 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float1.000000e-01_215 = torch.constant.float 1.000000e-01
    %227 = torch.aten.mul.Scalar %226, %float1.000000e-01_215 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %float9.000000e-01_216 = torch.constant.float 9.000000e-01
    %228 = torch.aten.mul.Scalar %arg16, %float9.000000e-01_216 : !torch.vtensor<[64],f32>, !torch.float -> !torch.vtensor<[64],f32>
    %int1_217 = torch.constant.int 1
    %229 = torch.aten.add.Tensor %227, %228, %int1_217 : !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64],f32>
    %230 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_6> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_218 = torch.constant.int -1
    %231 = torch.aten.unsqueeze %230, %int-1_218 : !torch.vtensor<[64],f32>, !torch.int -> !torch.vtensor<[64,1],f32>
    %int-1_219 = torch.constant.int -1
    %232 = torch.aten.unsqueeze %231, %int-1_219 : !torch.vtensor<[64,1],f32>, !torch.int -> !torch.vtensor<[64,1,1],f32>
    %233 = torch.aten.mul.Tensor %210, %232 : !torch.vtensor<[3,64,128,128],f32>, !torch.vtensor<[64,1,1],f32> -> !torch.vtensor<[3,64,128,128],f32>
    %234 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_7> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int-1_220 = torch.constant.int -1
